Tekla.Structures.Model.Solid.SolidIntersectionReturnTypeEnum
Solid intersection return type enumeration.

Tekla.Structures.Model.Solid.SolidIntersectionReturnTypeEnum.SOLID_INTERSECTION_COMPLETE
Intersection complete.

Tekla.Structures.Model.Solid.SolidIntersectionReturnTypeEnum.SOLID_INTERSECTION_CONTINUE_FACE
Intersection continue face.

Tekla.Structures.Model.Solid.SolidIntersectionReturnTypeEnum.SOLID_INTERSECTION_CONTINUE_LOOP
Intersection continue loop.

Tekla.Structures.Model.Solid.SolidIntersectionReturnTypeEnum.SOLID_INTERSECTION_CONTINUE_NEXT_FACE
Intersection continue next face.